IDEA StatiCa Open Model
ReinfBarByPolyline.BarShape Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Polyline representing shape of bar
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement BarShape { get; set; }
Public Property BarShape As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ BarShape {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
ReinfBarByPolyline Class
IdeaRS.OpenModel.Detail Namespace